In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [2]:
df=pd.read_csv("Social_Network_Ads.csv")
df

     Age  EstimatedSalary  Purchased
0     19            19000          0
1     35            20000          0
2     26            43000          0
3     27            57000          0
4     19            76000          0
..   ...              ...        ...
395   46            41000          1
396   51            23000          1
397   50            20000          1
398   36            33000          0
399   49            36000          1

[400 rows x 3 columns]

In [3]:
df.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [4]:
df.groupby(['Age'])['EstimatedSalary'].mean().head()

Age
18    66400.000000
19    46000.000000
20    61714.285714
21    61000.000000
22    48800.000000
Name: EstimatedSalary, dtype: float64

In [5]:
df.groupby(['Age'])['EstimatedSalary'].median().head()

Age
18    68000.0
19    26000.0
20    74000.0
21    70000.0
22    55000.0
Name: EstimatedSalary, dtype: float64

In [6]:
df.groupby(['Age'])['EstimatedSalary'].min().head()

Age
18    44000
19    19000
20    23000
21    16000
22    18000
Name: EstimatedSalary, dtype: int64

In [7]:
df.groupby(['Age'])['EstimatedSalary'].max().head()

Age
18    86000
19    85000
20    86000
21    88000
22    81000
Name: EstimatedSalary, dtype: int64

In [8]:
df.groupby(['Age'])['EstimatedSalary'].std().head()

Age
18    18297.540818
19    29416.548631
20    25447.424793
21    31219.651931
22    25984.610830
Name: EstimatedSalary, dtype: float64

In [9]:
label=['Teen','Young','Adult','Old']
cutoff=[0,18,30,55,100]
df['Category']=pd.cut(x=df['Age'],bins=cutoff,labels=label)

In [10]:
df

     Age  EstimatedSalary  Purchased Category
0     19            19000          0    Young
1     35            20000          0    Adult
2     26            43000          0    Young
3     27            57000          0    Young
4     19            76000          0    Young
..   ...              ...        ...      ...
395   46            41000          1    Adult
396   51            23000          1    Adult
397   50            20000          1    Adult
398   36            33000          0    Adult
399   49            36000          1    Adult

[400 rows x 4 columns]

In [11]:
df.groupby(['Category'])['EstimatedSalary'].mean()

Category
Teen     66400.000000
Young    61103.773585
Adult    72720.306513
Old      75285.714286
Name: EstimatedSalary, dtype: float64

In [12]:
df.groupby(['Category']).mean()

                Age  EstimatedSalary  Purchased
Category
Teen      18.000000     66400.000000   0.000000
Young     25.415094     61103.773585   0.056604
Adult     40.781609     72720.306513   0.425287
Old       58.357143     75285.714286   0.928571

In [13]:
df.groupby(['Category']).median()

           Age  EstimatedSalary  Purchased
Category
Teen      18.0          68000.0        0.0
Young     26.0          61500.0        0.0
Adult     40.0          71000.0        0.0
Old       58.5          75000.0        1.0

In [14]:
df.groupby(['Category']).value_counts()

Category  Age  EstimatedSalary  Purchased
Teen      18   68000            0            1
               44000            0            1
               86000            0            1
               82000            0            1
               52000            0            1
                                            ..
Old       32   38000            1            0
               39000            0            0
                                1            0
               41000            0            0
          60   150000           1            0
Length: 40248, dtype: int64